class Exon:
    def __init__(self, number):
        self.number = number
        self.number_string = ""
        decfirst = {0: '', 1: "перв", 2: "втор", 3: "трет", 4: "четверт", 5: "пят", 6: "шест", 7: "седьм", 8: "восьм",
                    9: "девят"}
        decsecond = {10: "десят", 11: "одиннадцат", 12: "двенадцат", 13: "тринадцат", 14: "четырнадцат",
                     15: "пятнадцат",
                     16: "шестнадцат", 17: "семнадцат", 18: "восемнадцат", 19: "девятнадцат"}
        decthird = {1: "десят", 2: "двадцат", 3: "тридцат", 4: "сорок", 5: "пятьдесят", 6: "шестьдесят", 7: "семьдесят",
                    8: "восемьдесят", 9: "девяност"}
        decthird2 = {4: "сороков", 5: "пятидесят", 6: "шестидесят", 7: "семидесят", 8: "восьмидесят"}
        endings = {1: "ый", 2: "ь", 3: "ой", 4: "ого", 5: "ий", 6: "ьего", 7: "овой", 8: "о"}

        genitive_root = {
            1: "первый", 2: "второй", 3: "третий", 4: "четвертый", 5: "пятый", 6: "шестой", 7: "седьмой", 8: "восьмой",
            9: "девят", 10: "десят", 11: "одиннадцатый", 12: "двенадцатый", 13: "тринадцатый", 14: "четырнадцатый",
            15: "пятнадцатый",16: "шестнадцатый", 17: "семнадцатый", 18: "восемнадцатый", 19: "девятнадцат"}

    def to_string_genitive(self, number):

