decfirst = {0: '', 1: "перв", 2: "втор", 3: "трет", 4: "четверт", 5: "пят", 6: "шест", 7: "седьм", 8: "восьм",
            9: "девят"}
decsecond = {10: "десят", 11: "одиннадцат", 12: "двенадцат", 13: "тринадцат", 14: "четырнадцат", 15: "пятнадцат",
             16: "шестнадцат", 17: "семнадцат", 18: "восемнадцат", 19: "девятнадцат"}
decthird = {1: "десят", 2: "двадцат", 3: "тридцат", 4: "сорок", 5: "пятьдесят", 6: "шестьдесят", 7: "семьдесят",
            8: "восемьдесят", 9: "девяност"}
decthird2 = {4: "сороков", 5: "пятидесят", 6: "шестидесят", 7: "семидесят", 8: "восьмидесят"}
endings = {1: "ый", 2: "ь", 3: "ой", 4: "ого", 5: "ий", 6: "ьего", 7: "овой", 8: "о"}
