slovar_KEGG = {1: 'одну геномную сеть', 2: 'две геномные сети', 3: 'три геномные сети', 4: 'четыре геномные сети',
               5: 'пять геномных сетей', 6: 'шесть геномных сетей', 7: 'семь геномных сетей',
               8: 'восемь геномных сетей',
               9: 'девять геномных сетей', 10: 'десять геномных сетей', 11: 'одиннадцать геномных сетей',
               12: 'двенадцать геномных сетей', 13: 'тринадцать геномных сетей', 14: 'четырнадцать геномных сетей',
               15: 'пятнадцать геномных сетей', 16: 'шестнадцать геномных сетей', 17: 'семнадцать геномных сетей',
               18: 'восемнадцать геномных сетей', 19: 'девятнадцать геномных сетей', 20: 'двадцать геномных сетей'}
